Белгипрозем_2017/src/DataProcessors/мПечатьВедомостьКомиссиииПоПодразделениям/мПечатьВедомостьКомиссиииПоПодразделениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>мПечатьВедомостьКомиссиииПоПодразделениям</name>
</mdclass:DataProcessor>

Белгипрозем_2017/src/Documents/М_ВедомостьКомиссии/М_ВедомостьКомиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>М_ВедомостьКомиссии</name>
  <registerRecords>AccumulationRegister.НачислениеЗП</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АктыПроверки</name>
    <attributes>
      <name>АктПроверки</name>
      <type>
        <types>CatalogRef.мАктыПроверки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПроверки</name>
      <type>
        <types>EnumRef.М_ВидыПроверкиКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентПроверки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаКомиссии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаНачОтдела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаГлавСпеца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаНачОтряда</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачальникОтдела</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ГлавныйСпециалист</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальникОтряда</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверяющийСТКК</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.мВидыРаботПоДоговорам</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАктирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаСТКК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаНачОтделаИтоговая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаГлавСпецаИтоговая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаНачОтрядаИтоговая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаИсполнителю</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выставлена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаЗамНачФилиала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаЗамНачФилиалаИтоговая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗамНачФилиала</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/DataProcessors/мПечатьВедомостьКомиссиииПоПодразделениям/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВедомостьКомиссии") Тогда
		ВедомостьКомиссии = Параметры.ВедомостьКомиссии;
	Иначе
		Возврат;
	КонецЕсли; 
	
	Дерево = ДанныеФормыВЗначение(ДеревоПредприятия, Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Различные
		|	М_ВедомостьКомиссииАктыПроверки.АктПроверки.Владелец.ЭтапДоговора.Подразделение КАК Подразделение
		|ИЗ
		|	Документ.М_ВедомостьКомиссии.АктыПроверки КАК М_ВедомостьКомиссииАктыПроверки
		|ГДЕ
		|	М_ВедомостьКомиссииАктыПроверки.Ссылка = &ВедомостьКомиссии";
	
	Запрос.УстановитьПараметр("ВедомостьКомиссии", ВедомостьКомиссии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивПодразделений = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивПодразделений.Добавить(Выборка.Подразделение);
		//ДобавитьЭлемент(Выборка.Подразделение, Неопределено, Дерево);
	КонецЦикла;
	
	ПостроитьДерево(Дерево, МассивПодразделений);
	
	ЗначениеВДанныеФормы(Дерево, ДеревоПредприятия);
КонецПроцедуры

&НаСервере
Процедура ПостроитьДерево(Дерево, МассивПодразделений)
	Массив1 = Новый Массив;	
	Массив2 = Новый Массив;
	
	// создаем массив строк
	Для каждого Подр Из МассивПодразделений Цикл
		НовСтрока = Дерево.Строки.Добавить();	
		НовСтрока.Подразделение = Подр;
		Массив1.Добавить(НовСтрока);
	КонецЦикла; 
	
	Пока Не Массив1.Количество() = 0 Цикл
		Для каждого Стр Из Массив1 Цикл
			Если ЗначениеЗаполнено(Стр.Подразделение.Родитель) Тогда
				// пытаемся найти нужную строку
				ИскСтрока = Дерево.Строки.Найти(Стр.Подразделение.Родитель);
				Если ИскСтрока = Неопределено Тогда
					ИскСтрока = Дерево.Строки.Добавить();
					ИскСтрока.Подразделение = Стр.Подразделение.Родитель;
					Массив2.Добавить(ИскСтрока);
				КонецЕсли;
				
				// перенос строки
				НовСтрока = ИскСтрока.Строки.Добавить();
				НовСтрока.Подразделение = Стр.Подразделение;
				
				Дерево.Строки.Удалить(Стр);
			КонецЕсли; 
		КонецЦикла; 
	    Массив1 = Массив2;
		Массив2 = Новый Массив;
	КонецЦикла; 
КонецПроцедуры
 
&НаСервере
Процедура ИзменитьПометкиПодчиненных(Подразделение, Пометка)
	Дерево = ДанныеФормыВЗначение(ДеревоПредприятия, Тип("ДеревоЗначений"));
	ИскСтрока = Дерево.Строки.Найти(Подразделение, "Подразделение", Истина);
	
	СтрокиДереваА = Новый Массив;
	СтрокиДереваБ = Новый Массив;
	СтрокиДереваА.Добавить(ИскСтрока);
	Пока НЕ (СтрокиДереваА.Количество() = 0) Цикл
		Для Каждого СтрокаДерева Из СтрокиДереваА Цикл
			СтрокаДерева.Пометка = ИскСтрока.Пометка;
			Для Каждого СтрокаДереваПодчиненная из СтрокаДерева.Строки Цикл
				СтрокиДереваБ.Добавить(СтрокаДереваПодчиненная);
			КонецЦикла;
		КонецЦикла;
		СтрокиДереваА = СтрокиДереваБ;
		СтрокиДереваБ = Новый Массив;
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДеревоПредприятия);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПредприятияИспользоватьПриИзменении(Элемент)
	ТекДанные = Элементы.ДеревоПредприятия.ТекущиеДанные;
	ИзменитьПометкиПодчиненных(ТекДанные.Подразделение, ТекДанные.Пометка);
	
	ЭлементыДерева = ДеревоПредприятия.ПолучитьЭлементы();
	Если ЭлементыДерева.Количество() = 0 Тогда Возврат КонецЕсли;
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл 
		Идентификатор = ЭлементДерева.ПолучитьИдентификатор();
		Элементы.ДеревоПредприятия.Развернуть(Идентификатор);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьПомеченных()
	
	Дерево = ДанныеФормыВЗначение(ДеревоПредприятия, Тип("ДеревоЗначений"));
	МассивПодразделений = Новый Массив;
		
	СтрокиДереваА = Новый Массив;
	СтрокиДереваБ = Новый Массив;
	
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		СтрокиДереваА.Добавить(СтрокаДерева);
	КонецЦикла; 
	
	Пока НЕ (СтрокиДереваА.Количество() = 0) Цикл
		Для Каждого СтрокаДерева Из СтрокиДереваА Цикл
				Для Каждого СтрокаДереваПодчиненная из СтрокаДерева.Строки Цикл
					СтрокиДереваБ.Добавить(СтрокаДереваПодчиненная);
				КонецЦикла;
			Если СтрокаДерева.Пометка Тогда
				МассивПодразделений.Добавить(СтрокаДерева.Подразделение);
			КонецЕсли;
		КонецЦикла;
		СтрокиДереваА = СтрокиДереваБ;
		СтрокиДереваБ = Новый Массив;
	КонецЦикла;
	
	Возврат МассивПодразделений;
КонецФункции // 
 
&НаКлиенте
Процедура ПечатьСОшибками(Команда)
	Состояние(НСтр("ru = 'Выполняется формирование печатной формы'"));
	
	МассивПодразделений = ПолучитьПомеченных();
	
	ТабДок = ПечатьВедомостьКомиссииСОшибкамиПоПодразделениям(МассивПодразделений);
	
	ТабДок.Показать(); 
КонецПроцедуры

&НаКлиенте
Процедура ПечатьБезОшибок(Команда)
	Состояние(НСтр("ru = 'Выполняется формирование печатной формы'"));
	
	МассивПодразделений = ПолучитьПомеченных();
	
	ТабДок = ПечатьВедомостьКомиссииБезОшибокПоПодразделениям(МассивПодразделений);
	
	ТабДок.Показать(); 
КонецПроцедуры

&НаСервере
Функция ПечатьВедомостьКомиссииСОшибкамиПоПодразделениям(МассивПодразделений)
	
	// Создаем табличный документ и устанавливаем имя параметров печати
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПФ_MXL_ВедомостьКомиссииСОшибками";
	// Запомним номер строки с которой начали выводить текущий документ
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	Макет = Обработки.мПечатьВедомостьКомиссиииПоПодразделениям.ПолучитьМакет("ПФ_MXL_ВедомостьКомиссииСОшибкамиПоПодразделениям");

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	М_ВедомостьКомиссииАктыПроверки.Ссылка,
        |	М_ВедомостьКомиссииАктыПроверки.НомерСтроки,
        |	М_ВедомостьКомиссииАктыПроверки.АктПроверки КАК АктПроверки,
        |	М_ВедомостьКомиссииАктыПроверки.АктПроверки.НомерАктаПроверки КАК НомерАктаПроверки,
        |	М_ВедомостьКомиссииАктыПроверки.АктПроверки.ДатаАктаПроверки КАК ДатаАктаПроверки,
        |	М_ВедомостьКомиссииАктыПроверки.ВидПроверки,
        |	М_ВедомостьКомиссииАктыПроверки.КоэффициентПроверки,
        |	М_ВедомостьКомиссииАктыПроверки.Исполнитель.ПредставлениеВДокументах КАК Исполнитель,
        |	М_ВедомостьКомиссииАктыПроверки.ОценкаКомиссии,
        |	М_ВедомостьКомиссииАктыПроверки.ОценкаНачОтдела,
        |	М_ВедомостьКомиссииАктыПроверки.ОценкаГлавСпеца,
        |	М_ВедомостьКомиссииАктыПроверки.ОценкаНачОтряда,
        |	М_ВедомостьКомиссииАктыПроверки.ОценкаСТКК,
        |	М_ВедомостьКомиссииАктыПроверки.НачальникОтдела.ПредставлениеВДокументах КАК НачальникОтдела,
        |	М_ВедомостьКомиссииАктыПроверки.ГлавныйСпециалист.ПредставлениеВДокументах КАК ГлавныйСпециалист,
        |	М_ВедомостьКомиссииАктыПроверки.НачальникОтряда.ПредставлениеВДокументах КАК НачальникОтряда,
        |	М_ВедомостьКомиссииАктыПроверки.ПроверяющийСТКК.ПредставлениеВДокументах КАК ПроверяющийСТКК,
        |	М_ВедомостьКомиссииАктыПроверки.Корреспондент,
        |	М_ВедомостьКомиссииАктыПроверки.Договор.РегистрационныйНомер КАК НомерДоговора,
        |	М_ВедомостьКомиссииАктыПроверки.Договор.ДатаРегистрации КАК ДатаДоговора,
        |	М_ВедомостьКомиссииАктыПроверки.ВидРабот,
        |	М_ВедомостьКомиссииАктыПроверки.НаименованиеОбъекта,
        |	М_ВедомостьКомиссииАктыПроверки.Ссылка.Номер КАК НомерВедомости,
        |	М_ВедомостьКомиссииАктыПроверки.Ссылка.Дата КАК ДатаВедомости,
        |	М_ВедомостьКомиссииАктыПроверки.ДатаАктирования КАК ДатаАктирования,
        |	М_ВедомостьКомиссииАктыПроверки.АктПроверки.Замечания.(
        |		Замечание КАК Замечание,
        |		Проверяющий.ПредставлениеВДокументах КАК Проверяющий,
        |		Содержание КАК Содержание,
        |		Оценка КАК Оценка
        |	) КАК Замечания,
        |	М_ВедомостьКомиссииАктыПроверки.АктПроверки.Владелец.ЭтапДоговора.Подразделение КАК Подразделение
        |ИЗ
        |	Документ.М_ВедомостьКомиссии.АктыПроверки КАК М_ВедомостьКомиссииАктыПроверки
        |ГДЕ
        |	М_ВедомостьКомиссииАктыПроверки.Ссылка В(&МассивОбъектов) И М_ВедомостьКомиссииАктыПроверки.АктПроверки.Владелец.ЭтапДоговора.Подразделение В(&МассивПодразделений)
		|	И М_ВедомостьКомиссииАктыПроверки.ОценкаСТКК < 1
        |ИТОГИ ПО
        |	Подразделение";

    Запрос.УстановитьПараметр("МассивОбъектов", ВедомостьКомиссии);
    Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений);
	
	Если Не ОценкаМеньше1 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И М_ВедомостьКомиссииАктыПроверки.ОценкаСТКК < 1", ""); 
	КонецЕсли; 

    РезультатЗапроса = Запрос.Выполнить();

    ВыборкаПодразделений = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьЗамечания = Макет.ПолучитьОбласть("Замечания");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	Пока ВыборкаПодразделений.Следующий() Цикл
        ПервыйДокумент = Истина;
		Выборка = ВыборкаПодразделений.Выбрать();
		НомерПП = 0;
		Пока Выборка.Следующий() Цикл
			Если ПервыйДокумент Тогда
				ПервыйДокумент = Ложь;
				//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				// Заголовок
				ОбластьЗаголовок.Параметры.НазваниеПредприятия = Константы.НаименованиеПредприятия.Получить();
				ОбластьЗаголовок.Параметры.Заголовок = "Ведомость комиссии № "+Число(Выборка.НомерВедомости) + 
				" от " + Формат(Выборка.ДатаВедомости, "ДЛФ=D")+" "+ВыборкаПодразделений.Подразделение;
				ТабличныйДокумент.Вывести(ОбластьЗаголовок);
				
				// Шапка
				ТабличныйДокумент.Вывести(ОбластьШапка);
			КонецЕсли;
			
			// Строки
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
			
			НомерПП = НомерПП+1;
			ОбластьСтрока.Параметры.НомерПП = НомерПП;
			ОбластьСтрока.Параметры.АктПроверки = Выборка.НомерАктаПроверки + " от " + Формат(Выборка.ДатаАктаПроверки, "ДЛФ=D");
			ОбластьСтрока.Параметры.Договор = Выборка.НомерДоговора + " от " + Формат(Выборка.ДатаДоговора, "ДЛФ=D");
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			// Замечания
			НомерЗамечания = 0;
			ВыборкаЗамечания = Выборка.Замечания.Выбрать();
			Пока ВыборкаЗамечания.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ОбластьЗамечания.Параметры, ВыборкаЗамечания);
				
				НомерЗамечания = НомерЗамечания + 1;
				ОбластьЗамечания.Параметры.НомерЗамечания = НомерЗамечания;
				
				ТабличныйДокумент.Вывести(ОбластьЗамечания);
			КонецЦикла; 
			ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		КонецЦикла;
        ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;

	Возврат ТабличныйДокумент;
КонецФункции 

&НаСервере
Функция ПечатьВедомостьКомиссииБезОшибокПоПодразделениям(МассивПодразделений)
	
	// Создаем табличный документ и устанавливаем имя параметров печати
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ВедомостьКомиссииБезОшибокПоПодразделениям";
	// Запомним номер строки с которой начали выводить текущий документ
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	Макет = Обработки.мПечатьВедомостьКомиссиииПоПодразделениям.ПолучитьМакет("ПФ_MXL_ВедомостьКомиссииБезОшибокПоПодразделениям");

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	М_ВедомостьКомиссииАктыПроверки.Ссылка,
        |	М_ВедомостьКомиссииАктыПроверки.НомерСтроки,
        |	М_ВедомостьКомиссииАктыПроверки.АктПроверки.НомерАктаПроверки КАК НомерАктаПроверки,
        |	М_ВедомостьКомиссииАктыПроверки.АктПроверки.ДатаАктаПроверки КАК ДатаАктаПроверки,
        |	М_ВедомостьКомиссииАктыПроверки.ВидПроверки,
        |	М_ВедомостьКомиссииАктыПроверки.КоэффициентПроверки,
        |	М_ВедомостьКомиссииАктыПроверки.Исполнитель.ПредставлениеВДокументах КАК Исполнитель,
        |	М_ВедомостьКомиссииАктыПроверки.ОценкаКомиссии,
        |	М_ВедомостьКомиссииАктыПроверки.ОценкаНачОтдела,
        |	М_ВедомостьКомиссииАктыПроверки.ОценкаГлавСпеца,
        |	М_ВедомостьКомиссииАктыПроверки.ОценкаНачОтряда,
        |	М_ВедомостьКомиссииАктыПроверки.ОценкаСТКК,
        |	М_ВедомостьКомиссииАктыПроверки.НачальникОтдела.ПредставлениеВДокументах КАК НачальникОтдела,
        |	М_ВедомостьКомиссииАктыПроверки.ГлавныйСпециалист.ПредставлениеВДокументах КАК ГлавныйСпециалист,
        |	М_ВедомостьКомиссииАктыПроверки.НачальникОтряда.ПредставлениеВДокументах КАК НачальникОтряда,
        |	М_ВедомостьКомиссииАктыПроверки.ПроверяющийСТКК.ПредставлениеВДокументах КАК ПроверяющийСТКК,
        |	М_ВедомостьКомиссииАктыПроверки.Корреспондент,
        |	М_ВедомостьКомиссииАктыПроверки.Договор.РегистрационныйНомер Как НомерДоговора,
        |	М_ВедомостьКомиссииАктыПроверки.Договор.ДатаРегистрации Как ДатаДоговора,
        |	М_ВедомостьКомиссииАктыПроверки.ВидРабот,
        |	М_ВедомостьКомиссииАктыПроверки.НаименованиеОбъекта,
        |	М_ВедомостьКомиссииАктыПроверки.Ссылка.Номер КАК НомерВедомости,
        |	М_ВедомостьКомиссииАктыПроверки.ДатаАктирования КАК ДатаАктирования,
        |	М_ВедомостьКомиссииАктыПроверки.Ссылка.Дата КАК ДатаВедомости,
        |	М_ВедомостьКомиссииАктыПроверки.АктПроверки.Владелец.ЭтапДоговора.Подразделение КАК Подразделение
        |ИЗ
        |	Документ.М_ВедомостьКомиссии.АктыПроверки КАК М_ВедомостьКомиссииАктыПроверки
        |ГДЕ
        |	М_ВедомостьКомиссииАктыПроверки.Ссылка В(&МассивОбъектов) И М_ВедомостьКомиссииАктыПроверки.АктПроверки.Владелец.ЭтапДоговора.Подразделение В(&МассивПодразделений)
		|	И М_ВедомостьКомиссииАктыПроверки.ОценкаСТКК < 1
        |ИТОГИ ПО
        |	Подразделение";

    Запрос.УстановитьПараметр("МассивОбъектов", ВедомостьКомиссии);
    Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений);

	Если Не ОценкаМеньше1 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И М_ВедомостьКомиссииАктыПроверки.ОценкаСТКК < 1", ""); 
	КонецЕсли; 

    РезультатЗапроса = Запрос.Выполнить();

    ВыборкаПодразделений = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

	Пока ВыборкаПодразделений.Следующий() Цикл
        ПервыйДокумент = Истина;
		Выборка = ВыборкаПодразделений.Выбрать();
		НомерПП = 0;
		Пока Выборка.Следующий() Цикл
			
			Если ПервыйДокумент Тогда
				ПервыйДокумент = Ложь;
				//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				// Заголовок
				ОбластьЗаголовок.Параметры.НазваниеПредприятия = Константы.НаименованиеПредприятия.Получить();
				ОбластьЗаголовок.Параметры.Заголовок = "Ведомость комиссии № "+Число(Выборка.НомерВедомости) + 
				" от " + Формат(Выборка.ДатаВедомости, "ДЛФ=D")+" "+ВыборкаПодразделений.Подразделение;
				ТабличныйДокумент.Вывести(ОбластьЗаголовок);
				
				// Шапка
				ТабличныйДокумент.Вывести(ОбластьШапка);
			КонецЕсли;
			
			// Строки
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
			
			НомерПП = НомерПП+1;
			ОбластьСтрока.Параметры.НомерПП = НомерПП;
			ОбластьСтрока.Параметры.АктПроверки = Выборка.НомерАктаПроверки + " от " + Формат(Выборка.ДатаАктаПроверки, "ДЛФ=D");
			ОбластьСтрока.Параметры.Договор = Выборка.НомерДоговора + " от " + Формат(Выборка.ДатаДоговора, "ДЛФ=D");
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
        КонецЦикла;
        ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
    КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 

&НаКлиенте
Процедура ПометитьВсе(Команда)
	ПометитьЭлементы(ДеревоПредприятия, 1);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	ПометитьЭлементы(ДеревоПредприятия, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПометитьЭлементы(ТекЭл, Флаг)
	Строки = ТекЭл.ПолучитьЭлементы();
	Для каждого Эл Из Строки Цикл
		Эл.Пометка = Флаг;
		ПометитьЭлементы(Эл, Флаг);
	КонецЦикла; 
КонецПроцедуры
